#ifndef __Shape__
#define __Shape__

//------------------------------------------------------------------------------
// Shape.h - содержит описание растения(обобщающего типа данных)
//------------------------------------------------------------------------------

#include <fstream>
#include <cstring>
#include "rnd.h"

//------------------------------------------------------------------------------
// Класс, обобщающий все имеющиеся фигуры.
class Shape {
public:
    virtual ~Shape() = default;

    // Ввод обобщенной фигуры из файла.
    virtual void In(std::ifstream &ifst) = 0;

    // Случайный ввод обобщенной фигуры.
    virtual void InRnd() = 0;

    // Вывод обобщенной фигуры в форматируемый поток.
    virtual void Out(std::ofstream &ofst) = 0;

    // Вычисление периметра фигуры.
    virtual double Perimeter() = 0;
};

#endif //__Shape__
