//------------------------------------------------------------------------------
// circle.cpp - содержит функции обработки треугольника.
//------------------------------------------------------------------------------

#include "circle.h"
#include <iostream>
#define _USE_MATH_DEFINES
#include <math.h>

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока.
void In(circle& c, ifstream& ifst) {
    ifst >> c.x >> c.y >> c.r;
}

// Случайный ввод параметров треугольника.
void InRnd(circle& c) {
    c.x = Random();
    c.y = Random();
    c.r = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток.
void Out(circle& c, ofstream& ofst) {
    ofst << "It is Circle: x = "
        << c.x << ", y = " << c.y
        << ", r = " << c.r
        << ". Perimeter = " << Perimeter(c) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра треугольника.
double Perimeter(circle& c) {
    return 2.0 * M_PI * c.r;
}
