//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров 
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void In(rectangle& r, ifstream& ifst) {
    ifst >> r.x1 >> r.y1 >> r.x2 >> r.y2;
}

// Случайный ввод параметров прямоугольника
void InRnd(rectangle& r) {
    r.x1 = Random();
    r.y1 = Random();
    r.x2 = Random();
    r.y2 = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void Out(rectangle& r, ofstream& ofst) {
    ofst << "It is Rectangle: x1 = " << r.x1 << ", y1 = " << r.y1 
        << ", x2 = " << r.x2 << ", y2 = " << r.y2
        << ". Perimeter = " << Perimeter(r) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Perimeter(rectangle& r) {
    return 2.0 * abs(r.x2 - r.x1) + 2.0 * abs(r.y2 - r.y1);
}
